package by.sonya.homework2;

//6)Напишите программу вывода всех четных чисел от 2 до 100 включительно

public class Task28 {
    public static void main(String[] args) {

        for(int i = 2; i <=100; i += 2){
            System.out.print(i + " ");
        }
    }
}
